app/controllers/admins_controller.rb

INSERT INTO `admins` (`single_access_token`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `password_salt`, `persistence_token`, `login`, `email`) VALUES('F2iwX9519HGuGfjHKwI_', '2010-05-19 03:07:30', 'a6c41cdcfedfea4922331a2e0d98b64b251abe8ade243dfbdb288421822d56e2678de2ea04304d049d81c275b5e39971705612ce9b96da1b26401a55619a6202', 'r1NL-Q3MVceQtdnVdbYm', '2010-05-19 03:07:30', 'TkMrI_C0c5unisnJ3jua', '9848b3086d6a8059a2495e90ccc20e1a35d0c844b737830a891625468ab3e5ca24cf2a8991af99e57300c036e49f3a1d1b2cf076f04bd023563e2d19829a4e60', 'admin', 'youremail@here.com')
---
  def create
    @admin = Admin.new(params[:admin])
    if @admin.save

UPDATE `admins` SET `updated_at` = '2010-05-19 04:21:20', `login` = 'three', `crypted_password` = '4fbe18123124417058f9293e8afd4a23bf0f75f256164daf48cb9d9a3668cd43bf7fe21a5665954953a5467309885374ba03791d569d0ed2951008f7deae256d', `perishable_token` = 'qoPldfpfUReYBPe03VM7', `email` = 'three@here.com', `password_salt` = '_xWQuCKqIq-Vww7hfjzm', `persistence_token` = 'd54a379cbc266aacb5ca81f81ddc70ff9264070fdb47e4e8d1a814fe04c19d5c0b4a8eb706608c9954cb5b629559be4f46b4812db332f561285f141c42c0b1b6' WHERE `id` = 980190962
---
  def update
    @admin = @current_admin
    @uattr = params[:admin]
    @uattr[:login]   = @admin.login
    @uattr[:email] ||= @admin.email
    if (@uattr.include? :password) && (@uattr.include? :password_confirmation)
      if @admin.update_attributes(@uattr)

SELECT * FROM `admins` LIMIT 1
---
  def index
    @admins = Admin.all

SELECT * FROM `admins` WHERE (`admins`.`id` = 1)
---
  def show
    @admin = Admin.find(params[:id])

DELETE FROM `admins` WHERE `id` = 980190962
SELECT * FROM `admins` WHERE (`admins`.`id` = 980190962)
---
  def destroy
    Admin.find(params[:id]).destroy