app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.isActivated?
      if @user.save
---
INSERT INTO `users` (`voter_id`, `district_code`, `created_at`, `updated_at`, `birth_date`, `provincial_code`, `voted`, `last_name`, `street_number`, `municipality_code`, `activated`, `street_name`, `first_name`, `middle_name`, `email`) VALUES('qwer', 1, '2010-05-19 06:48:23', '2010-05-19 06:48:23', '-4712-01-01', 'asdf', 1, 'Suarez', 1, 'asdf', 1, 'string', 'Alejandro', 'Marasigan', 'aaaa@asdf.com')

  def update
    @user = User.find(params[:id])
      p @user.inspect
      p "################################"
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 980190976)
UPDATE `users` SET `updated_at` = '2010-05-19 07:00:34', `voter_id` = 'qwer', `email` = 'aaaa@asdf.com', `birth_date` = '-4712-01-01' WHERE `id` = 980191024

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 980190974)
DELETE FROM `users` WHERE `id` = 980190974